versiontracker/app/controllers/components_controller.rb

  def index
    @components = Component.all

    check_api_key

    c_n = params[:comp_name]
    v_num = params[:version]
    comp = {}
    ver = {}
    comp["name"] = c_n
    comp["c_type"] = "gem"
    Component.create(comp)
    last_id = Component.last.id
    ver["version_num"] = v_num
    ver["component_id"] = last_id
    Version.create(ver)
---
SELECT * FROM `components` ORDER BY components.id DESC LIMIT 1
INSERT INTO `components` (`name`, `c_type`, `created_at`, `updated_at`) VALUES('actionmailer', 'gem', '2010-03-07 04:26:09', '2010-03-07 04:26:09')
INSERT INTO `versions` (`version_num`, `component_id`, `created_at`, `updated_at`) VALUES('2.3.4', 1, '2010-03-07 04:26:09', '2010-03-07 04:26:09')

  def show
    @component = Component.find(params[:id])
---
SELECT * FROM `components` WHERE (`components`.`id` = 1)

  def edit
    @component = Component.find(params[:id])
---
SELECT * FROM `components` WHERE (`components`.`id` = 2)

  def create
    @component = Component.new(params[:component])
    respond_to do |format|
      if @component.save
---
INSERT INTO `components` (`name`, `c_type`, `created_at`, `updated_at`) VALUES('mysql', 'database', '2010-01-29 20:47:11', '2010-01-29 20:47:11')

  def destroy
    @component = Component.find(params[:id])
    @component.destroy
---
SELECT * FROM `components` WHERE (`components`.`id` = 1)
DELETE FROM `components` WHERE `id` = 1