versiontracker/app/controllers/users_controller.rb

INSERT INTO `users` (`login`, `crypted_password`, `password_salt`, `persistence_token`, `single_access_token`, `perishable_token`, `created_at`, `updated_at`) VALUES('testtest', 'a6bc391ed106d3caafbbd8dfb373f260ae3867f9ec11f4b393dc843665e3773af5220453df68345483e47dbaf905b4c68389f30d9d15c72a2865d315bc88a893', '8HHRu4sXvuKdlIumy_c-', '648132c5903820386b09fc2fb0a58807dc50937800c98669d6d5a790729133b920d6245562262f74bd9a8da945308eef102517bc669a5c0b827cae1e16f08248', 'MCYXS7zU21sYGyJBk5-P', 'aYDe9zU3euQUPepR9D2X', '2010-03-06 10:24:25', '2010-03-06 10:24:25')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `password_salt` = 'rxfIRds2OLdJdSXBpe5g', `crypted_password` = 'cdec7bff6158dde5c2475e9da12678f9c447255610800f2ed637135883e362cc9037845b8632329e749258f8488397d03c4c8cebdba6d0dda528b70312ae03b2', `persistence_token` = 'fc3482af57cb3b7a04179bb406b7e2c249750cf925b5c55b852c51ccebcb16b7afe07d34b9a62d853fac7bc853553d8bf2148ddaa6dfce726160543c760b76d3', `perishable_token` = 'cCKP4YddztrxIBdEjrGT', `updated_at` = '2010-03-06 22:49:40' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])