versiontracker/app/controllers/users_controller.rb

  def show
    @user = @current_user

    @components = Component.all
    @versions = Version.all

    @a = Array.new().map!{Hash.new()}
      Version.find_each do |version|
        @a.insert(0, {"version_num" => version.version_num,
            "component_name" => Component.find(version.component_id).name})
---
SELECT * FROM `components`
SELECT * FROM `versions`
SELECT * FROM `versions` WHERE (versions.id >= 0) ORDER BY versions.id ASC LIMIT 1000
SELECT * FROM `components` WHERE (`components`.`id` = 1)